Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartExcludedPartWarning Property
 There were fabrication parts needed to the make the connection that were excluded from the fabrication service causing the connection to fail. You may try to inlcude these fitting(s) and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartExcludedPartWarning { get; }
Public Shared ReadOnly Property FabricationPartExcludedPartWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartExcludedPartWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartExcludedPartWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace